using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Playground2.DI
{
    //1.2.2. Достоинства внедрения зависимостей
    //Динамическое связывание
    //Расширяемость
    //Параллельная разработка
    //Легкость в сопровождении
    //1.3. Что следует и что не следует внедрять
    //1.3.1. Швы
    //1.3.2. Стабильные зависимости
    //1.3.2. Стабильные зависимости
    //1.4. Область применения внедрения
    //зависимостей
    //1.4.1. Композиция объектов
    //1.4.2. Жизненный цикл объектов
    //1.4.3. Перехват
    //приложения, такие как ведение логов, аудит, управление доступом, валидация и т. д., в четкой структуре, позволяющей поддерживать разделение аспектов.
    //1.4.4. Внедрение зависимостей в трех измерениях
    //
    
    class DI
    {
    }

}
